app/controllers/users_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "fname", "lname", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save

UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["encrypted_password", "$2a$10$WLVBVeU6cFsF/.cr9y046u.dBasOjb6vKwUBIHjWgadyHQ1kyo/hS"], ["updated_at", "2015-02-09 07:58:23.742477"], ["id", 1]]
---
  def update
    if params[:user][:password].blank?
      params[:user].delete("password")
      params[:user].delete("password_confirmation")
    end
    respond_to do |format|
      if @user.update(user_params)